fe32/tutorials/rheoFoam/OtherTests/tube_GNF/HerschelBulkley/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       9440;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       9480;
    }
    walls
    {
        type            wall;
        nFaces          120;
        startFace       9520;
    }
    axis
    {
        type            empty;
        nFaces          0;
        startFace       9640;
    }
    wFront
    {
        type            wedge;
        nFaces          4800;
        startFace       9640;
    }
    wBack
    {
        type            wedge;
        nFaces          4800;
        startFace       14440;
    }
)


// ************************************************************************* //
